In [2]:
import pandas as pd
import numpy as np

In [3]:
bollywood_df = pd.read_csv('../Machine-Learning-with-Python-/bollywood.csv')
bollywood_df.head().transpose()

,0,1,2,3,4
SlNo,1,2,3,4,5
Release Date,18-Apr-14,4-Jan-13,18-Jul-14,4-Jan-13,4-Jul-14
MovieName,2 States,Table No. 21,Amit Sahni Ki List,Rajdhani Express,Bobby Jasoos
ReleaseTime,LW,N,N,N,N
Genre,Romance,Thriller,Comedy,Drama,Comedy
Budget,36,10,10,7,18
BoxOfficeCollection,104.0,12.0,4.0,0.35,10.8
YoutubeViews,8576361,1087320,572336,42626,3113427
YoutubeLikes,26622,1129,586,86,4512
YoutubeDislikes,2527,137,54,19,1224

In [4]:
list(bollywood_df.columns)

['SlNo',
 'Release Date',
 'MovieName',
 'ReleaseTime',
 'Genre',
 'Budget',
 'BoxOfficeCollection',
 'YoutubeViews',
 'YoutubeLikes',
 'YoutubeDislikes']

In [7]:
bollywood_df.describe()

,SlNo,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes
count,149.000000,149.000000,149.000000,1.490000e+02,149.000000,149.000000
mean,75.000000,29.442953,55.667248,3.337920e+06,7877.536913,1207.818792
std,43.156691,28.237981,94.494531,3.504407e+06,12748.047191,1852.692938
min,1.000000,2.000000,0.010000,4.354000e+03,1.000000,1.000000
25%,38.000000,11.000000,8.780000,1.076591e+06,1377.000000,189.000000
50%,75.000000,21.000000,28.000000,2.375050e+06,4111.000000,614.000000
75%,112.000000,35.000000,57.450000,4.550051e+06,9100.000000,1419.000000
max,149.000000,150.000000,735.000000,2.317107e+07,101275.000000,11888.000000

In [6]:
bollywood_df.shape

(149, 10)

In [7]:
bollywood_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   SlNo                 149 non-null    int64
 1   Release Date         149 non-null    object
 2   MovieName            149 non-null    object
 3   ReleaseTime          149 non-null    object
 4   Genre                149 non-null    object
 5   Budget               149 non-null    int64
 6   BoxOfficeCollection  149 non-null    float64
 7   YoutubeViews         149 non-null    int64
 8   YoutubeLikes         149 non-null    int64
 9   YoutubeDislikes      149 non-null    int64
dtypes: float64(1), int64(5), object(4)
memory usage: 11.8+ KB

In [9]:
# Movies released in each genre
bollywood_df.Genre.value_counts()

Genre
Comedy       36
 Drama       35
Thriller     26
Romance      25
Action       21
Thriller      3
Action        3
Name: count, dtype: int64

In [12]:
#Which Genre has highest number of releases?
print("Comedy Genre has the highest number of releases")
bollywood_df.Genre.value_counts(ascending=True)

Comedy Genre has the highest number of releases

Genre
Thriller      3
Action        3
Action       21
Romance      25
Thriller     26
 Drama       35
Comedy       36
Name: count, dtype: int64

# How many movies in each genre got released in different release times like long weekend, festive season, etc. (Note: Do a cross tabulation between Genre and ReleaseTime.)

In [20]:
releaseTime_df = pd.crosstab(bollywood_df.Genre,bollywood_df.ReleaseTime)
releaseTime_df.rename({
    'FS':"Festival Season",
    'HS':"Holiday Season",
    'LW':"Long Weekend",
    'N':"Normal"
},axis=1,inplace=True)

releaseTime_df

ReleaseTime  Festival Season  Holiday Season  Long Weekend  Normal
Genre
 Drama                     4               6             1      24
Action                     3               3             3      12
Action                     0               0             0       3
Comedy                     3               5             5      23
Romance                    3               3             4      15
Thriller                   4               1             1      20
Thriller                   0               0             1       2

# Which month of the year, maximum number movie releases are seen? (Note: Extract a new column called month from ReleaseDate column.)

In [21]:
def ReleaseMonth(date_):
    
    return date_.split("-")[1];

ReleaseMonth("18-Jul-14")

'Jul'

In [29]:
bollywood_df['ReleaseMonth'] = bollywood_df.apply(lambda x:x['Release Date'].split("-")[1],axis=1)
bollywood_df.ReleaseMonth.value_counts()

ReleaseMonth
Jan    20
Mar    19
May    18
Jul    16
Feb    16
Apr    11
Sep    10
Jun    10
Nov    10
Oct     9
Aug     8
Dec     2
Name: count, dtype: int64

In [30]:
print("Jan month has the maximum number of movie release")

Jan month has the maximum number of movie release

# Which month of the year typically sees most releases of high budgeted movies, that is, movies with budget of 25 crore or more?

In [31]:
bollywood_df[bollywood_df.Budget >= 25].ReleaseMonth.value_counts()

ReleaseMonth
Feb    9
Jan    8
Mar    7
Aug    7
Nov    6
Jul    6
Sep    5
Jun    5
Apr    4
Oct    4
May    3
Dec    2
Name: count, dtype: int64

In [32]:
print("Feb month of the year typically sees most releases of high budgeted movies")

Feb month of the year typically sees most releases of high budgeted movies

# Which are the top 10 movies with maximum return on investment (ROI)? Calculate return on investment (ROI) as (BoxOfficeCollection â€“ Budget) / Budget.

In [52]:
bollywood_df['roi'] = bollywood_df.apply(lambda x:(x.BoxOfficeCollection-x.Budget)/x.Budget,axis=1)
bollywood_df.sort_values(by='roi',ascending=False).head(10)[['MovieName','roi']]

                     MovieName       roi
64                  Aashiqui 2  8.166667
89                          PK  7.647059
132                Grand Masti  7.514286
135               The Lunchbox  7.500000
87                      Fukrey  6.240000
58                    Mary Kom  5.933333
128                     Shahid  5.666667
37   Humpty Sharma Ki Dulhania  5.500000
101         Bhaag Milkha Bhaag  4.466667
115            Chennai Express  4.266667